ИС_СПОРТ_2022/src/Documents/ДопускиУчастниковКСпортивнымСоревнованиям/ДопускиУчастниковКСпортивнымСоревнованиям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДопускиУчастниковКСпортивнымСоревнованиям</name>
  <registerRecords>InformationRegister.РегистрацияДопусковКСпортивнымСоревнованиям</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияДопуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДопуска</name>
    <type>
      <types>EnumRef.ВидыДопусковКСпортивнойДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставСпортсмены</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МедицинскаяОрганизация</name>
    <type>
      <types>CatalogRef.МедицинскиеОрганизации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Спортсмены</name>
    <attributes>
      <name>Спортсмен</name>
      <type>
        <types>CatalogRef.Спортсмены</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПолученияДопуска</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетДо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/Documents/ДопускиУчастниковКСпортивнымСоревнованиям/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"			, ДокументСсылка);
	Запрос.УстановитьПараметр("ВидДопуска"      , ДокументСсылка.ВидДопуска);
	Запрос.УстановитьПараметр("Организация"   	, ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("ВидСпорта"     	, ДокументСсылка.ВидСпорта);
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	""РегистрацияДопусковКСпортивнымСоревнованиям"" КАК ИмяРегистра_,
	                |	ДопускиУчастниковКСпортивнымСоревнованиямСпортсмены.Спортсмен КАК Спортсмен,
	                |	ДопускиУчастниковКСпортивнымСоревнованиямСпортсмены.ДатаПолученияДопуска КАК ДатаПолученияДопуска,
	                |	ДопускиУчастниковКСпортивнымСоревнованиямСпортсмены.ДействуетДо КАК ДействуетДо,
	                |	&ВидСпорта КАК ВидСпорта,
	                |	&Организация КАК Организация,
	                |	&ВидДопуска КАК ВидДопуска,
	                |	ДопускиУчастниковКСпортивнымСоревнованиямСпортсмены.ДатаПолученияДопуска КАК Период
	                |ИЗ
	                |	Документ.ДопускиУчастниковКСпортивнымСоревнованиям.Спортсмены КАК ДопускиУчастниковКСпортивнымСоревнованиямСпортсмены
	                |ГДЕ
	                |	ДопускиУчастниковКСпортивнымСоревнованиямСпортсмены.Ссылка = &Ссылка
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ДопускиУчастниковКСпортивнымСоревнованиямСпортсмены.ДатаПолученияДопуска,
	                |	ДопускиУчастниковКСпортивнымСоревнованиямСпортсмены.Спортсмен,
	                |	ДопускиУчастниковКСпортивнымСоревнованиямСпортсмены.ДействуетДо,
	                |	ДопускиУчастниковКСпортивнымСоревнованиямСпортсмены.ДатаПолученияДопуска";
	
	ТаблицаРегистрацияДопусковКСпортивнымСоревнованиям = Запрос.Выполнить().Выгрузить();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаРегистрацияДопусковКСпортивнымСоревнованиям"           , ТаблицаРегистрацияДопусковКСпортивнымСоревнованиям);
	
    ДополнительныеСвойства.Вставить("Отказ", Отказ);
	
КонецПроцедуры	

Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ДопускиУчастниковКСпортивнымСоревнованиям.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольПередПроведением(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ДопускиУчастниковКСпортивнымСоревнованиям.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовОтменыПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ДопускиУчастниковКСпортивнымСоревнованиям.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры
